_Scott_Howard/practice/rewsly/app/controllers/comments_controller.rb

  def create
    safe_comment = params.require(:comment).permit(:post)
    story_id = params[:story_id]
    story = Story.find(story_id)
    @comment = current_user.comments.build safe_comment
    @comment.story = story
    @comment.save
---
SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("created_at", "post", "story_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-06 01:04:15.675806"], ["post", "This is my first comment"], ["story_id", 1], ["updated_at", "2014-08-06 01:04:15.675806"], ["user_id", 1]]