_Scott_Howard/practice/rewsly/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'sh' AND "users"."password" = '89c4ec9f6b3f1086b158d8ef03dfe8155e6f79d9e66434b8f9b3432fe8720e50'  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    @user = User.find_authenticated_user(params[:username], params[:password])