_Scott_Howard/practice/rewsly/app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"  WHERE (title LIKE '%%' OR category LIKE '%%')
---
  def index
    @stories = Story.search(params[:q])

INSERT INTO "stories" ("category", "created_at", "link", "title", "updated_at", "upvotes", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category", "alien"], ["created_at", "2014-08-06 01:03:58.839555"], ["link", "www.b1.com"], ["title", "Big one"], ["updated_at", "2014-08-06 01:03:58.839555"], ["upvotes", 1], ["user_id", 1]]
---
  def create
    safe_story_params = params.require(:story).permit(:title, :link, :category)
    @story = current_user.stories.build safe_story_params.merge(:upvotes => 1)

    if @story.save

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @story = Story.find params[:id]