_Scott_Howard/practice/rewsly/app/views/stories/show.html.erb

<h1><%= @story.title %> -  <%= "Posted by #{@story.user.username}" if @story.user.present?%></h1>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

<ul class="comments">
  <% @story.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."story_id" = ?  [["story_id", 1]]